cloned-dambreak501/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

scale 0.146;

vertices
  24
  (
    (0 0 0)
    (1.5 0 0)
    (1.7 0 0)
    (4 0 0)
    (0 0.32876 0)
    (1.5 0.32876 0)
    (1.7 0.32876 0)
    (4 0.32876 0)
    (0 4 0)
    (1.5 4 0)
    (1.7 4 0)
    (4 4 0)
    (0 0 0.1)
    (1.5 0 0.1)
    (1.7 0 0.1)
    (4 0 0.1)
    (0 0.32876 0.1)
    (1.5 0.32876 0.1)
    (1.7 0.32876 0.1)
    (4 0.32876 0.1)
    (0 4 0.1)
    (1.5 4 0.1)
    (1.7 4 0.1)
    (4 4 0.1)
  );

blocks
  25
  (
    hex

    (
      0
      1
      5
      4
      12
      13
      17
      16
    )
    (23 8 1)
    simpleGrading
    (1 1 1)
    hex

    (
      2
      3
      7
      6
      14
      15
      19
      18
    )
    (19 8 1)
    simpleGrading
    (1 1 1)
    hex

    (
      4
      5
      9
      8
      16
      17
      21
      20
    )
    (23 42 1)
    simpleGrading
    (1 1 1)
    hex

    (
      5
      6
      10
      9
      17
      18
      22
      21
    )
    (4 42 1)
    simpleGrading
    (1 1 1)
    hex

    (
      6
      7
      11
      10
      18
      19
      23
      22
    )
    (19 42 1)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

boundary
  (
    leftWall

    {
      type wall;
      faces
        (

          (
            0
            12
            16
            4
          )

          (
            4
            16
            20
            8
          )
        );

    }
    rightWall

    {
      type wall;
      faces
        (

          (
            7
            19
            15
            3
          )

          (
            11
            23
            19
            7
          )
        );

    }
    lowerWall

    {
      type wall;
      faces
        (

          (
            0
            1
            13
            12
          )

          (
            1
            5
            17
            13
          )

          (
            5
            6
            18
            17
          )

          (
            2
            14
            18
            6
          )

          (
            2
            3
            15
            14
          )
        );

    }
    atmosphere

    {
      type patch;
      faces
        (

          (
            8
            20
            21
            9
          )

          (
            9
            21
            22
            10
          )

          (
            10
            22
            23
            11
          )
        );

    }
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

